---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectShapeTypeOptions
source: html/6fdf37fa-8719-0bff-1074-cc083a523d20.htm
---
# DirectShapeTypeOptions Members

Constructs a new DirectShapeTypeOptions instance with default settings.